{
  "Tool Name": "EMFIF2 - Electro Magnetic Fault Injection Fuzzing Framework",
  "Description": "In an era where embedded systems are increasingly integral to critical infrastructure, the need for robust hardware security has never been more paramount. However, conventional security testing methods often overlook physical attack vectors, particularly fault injection attacks. This presentation introduces EMFIF2, an advanced Electro Magnetic Fault Injection Fuzzing Framework designed to expose vulnerabilities in hardware through targeted electromagnetic pulse (EMP) attacks.
EMFIF2 leverages the precision of CNC machines combined with an EMP generator to automate fault injection, enabling researchers and engineers to conduct sophisticated hardware attacks with minimal manual intervention. The framework offers a modular and customizable approach to fuzzing, allowing users to script complex fault scenarios and observe device responses in real-time.
Through a series of case studies, this talk will demonstrate EMFIF2's effectiveness in uncovering flaws in popular embedded systems. We will discuss the framework's architecture, the integration of CNC and EMP technologies, and the challenges of replicating physical attack conditions in a controlled environment. Attendees will gain insights into setting up their own fault injection experiments and learn best practices for enhancing the security of hardware designs against such threats.
Whether you are a security researcher, embedded developer, or hardware enthusiast, EMFIF2 provides a powerful toolset for advancing your understanding of fault injection attacks and fortifying your hardware against them.
Keywords: Hardware Security, Embedded Security, Fault Injection, Electro Magnetic Fault Injection, Fuzzing, Secure Hardware Development Lifecycle
",
"GitHub URL": "https://github.com/ZTE-Cybersecurity-Lab/EMFIF2",
  "Tracks": [
    "Hardware/Embedded"
  ],
  "Speakers": [
    "Luca Bongiorni",
    "Andrea Bissoli"
  ],
  "Region": "Europe",
  "Year": "2025"
}
